feaser/openblt/Target/Source/ARMCM0_STM32L0/flash.c
  /* initialize tne new block when necessary */
  if (FlashInitBlock(block, base_addr) == BLT_FALSE)
  {
    return BLT_NULL;
  }

  /* still here to all is okay  */
  return block;
} /*** end of FlashSwitchBlock ***/


/************************************************************************************//**
** \brief     Programming is done per block. This function adds data to the block
**            that is currently collecting data to be written to flash. If the
**            address is outside of the current block, the current block is written
**            to flash an a new block is initialized.
** \param     block   Pointer to flash block info structure to operate on.
** \param     address Flash destination address.
** \param     data    Pointer to the byte array with data.
** \param     len     Number of bytes to add to the block.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                blt_int8u *data, blt_int32u len)
{
  blt_addr   current_base_addr;
  blt_int8u  *dst;
  blt_int8u  *src;

  /* determine the current base address */
  current_base_addr = (address/FLASH_WRITE_BLOCK_SIZE)*FLASH_WRITE_BLOCK_SIZE;

  /* make sure the blockInfo is not uninitialized */
  if (block->base_addr == FLASH_INVALID_ADDRESS)
  {
    /* initialize the blockInfo struct for the current block */
    if (FlashInitBlock(block, current_base_addr) == BLT_FALSE)
    {
      return BLT_FALSE;
    }
  }

  /* check if the new data fits in the current block */
  if (block->base_addr != current_base_addr)
  {
    /* need to switch to a new block, so program the current one and init the next */
    block = FlashSwitchBlock(block, current_base_addr);
    if (block == BLT_NULL)
    {
      return BLT_FALSE;
    }
  }

  /* add the data to the current block, but check for block overflow */
  dst = &(block->data[address - block->base_addr]);
  src = data;
  do
  {
    /* keep the watchdog happy */
    CopService();
    /* buffer overflow? */
    if ((blt_addr)(dst-&(block->data[0])) >= FLASH_WRITE_BLOCK_SIZE)
    {
      /* need to switch to a new block, so program the current one and init the next */
      block = FlashSwitchBlock(block, current_base_addr+FLASH_WRITE_BLOCK_SIZE);
      if (block == BLT_NULL)
      {
        return BLT_FALSE;
      }
      /* reset destination pointer */
      dst = &(block->data[0]);
    }
    /* write the data to the buffer */
    *dst = *src;
    /* update pointers */
    dst++;
    src++;
    /* decrement byte counter */
    len--;
  }
  while (len > 0);
  /* still here so all is good */
  return BLT_TRUE;
} /*** end of FlashAddToBlock ***/


/************************************************************************************//**
** \brief     Programs FLASH_WRITE_BLOCK_SIZE bytes to flash from the block->data
**            array.
** \param     block   Pointer to flash block info structure to operate on.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashWriteBlock(tFlashBlockInfo *block)
{
  blt_bool         result = BLT_TRUE;
  blt_addr         half_page_addr;
  blt_int32u *     half_page_data_ptr;
  blt_int32u       half_page_cnt;
  blt_int32u const half_page_size = FLASH_PAGE_SIZE/2U;
  blt_addr         word_addr;
  blt_int32u       word_data;
  blt_int32u       word_cnt;

#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
  #if (BOOT_NVM_CHECKSUM_HOOKS_ENABLE == 0)
  /* note that the bootblock is already decrypted in FlashWriteChecksum(), if the
   * internal checksum mechanism is used. Therefore don't decrypt it again.
   */
  if (block != &bootBlockInfo)
  #endif
  {
    /* perform decryption of the program data before writing it to flash memory. */
    if (FlashCryptoDecryptDataHook(block->data, FLASH_WRITE_BLOCK_SIZE) == BLT_FALSE)
    {
      return BLT_FALSE;
    }
  }
#endif

  /* unlock the flash peripheral to enable the flash control register access. */
  HAL_FLASH_Unlock();

  /* sanity check. make sure the block's destination address is aligned to a half page
   * size.
   */
  ASSERT_RT((block->base_addr % half_page_size) == 0);

  /* program the block in chunks of half a page (128 bytes) with the help of function
   * HAL_FLASHEx_HalfPageProgram() that runs from RAM. Alternatively, you could use
   * function HAL_FLASH_Program() that runs from flash and programs 4 bytes at a time.
   * However, it turns out that this one runs really slow on the STM32L1.
   */
  for (half_page_cnt=0; half_page_cnt<(FLASH_WRITE_BLOCK_SIZE/half_page_size); half_page_cnt++)
  {
    half_page_addr = block->base_addr + (half_page_cnt * half_page_size);
    half_page_data_ptr = (blt_int32u *)(&block->data[half_page_cnt * half_page_size]);
    /* keep the watchdog happy */
    CopService();
    /* program the half page */
    if (HAL_FLASHEx_HalfPageProgram(half_page_addr, (uint32_t *)half_page_data_ptr) != HAL_OK)
    {
      result = BLT_FALSE;
      break;
    }
  }

  /* only continue with the data verification, if no error was detected so far. */
  if (result == BLT_TRUE)
  {
    /* verify all words in the block one by one. */
    for (word_cnt=0; word_cnt<(FLASH_WRITE_BLOCK_SIZE/sizeof(blt_int32u)); word_cnt++)
    {
      word_addr = block->base_addr + (word_cnt * sizeof(blt_int32u));
      word_data = *(volatile blt_int32u *)(&block->data[word_cnt * sizeof(blt_int32u)]);
      /* keep the watchdog happy. */
      CopService();
      /* verify that the written data is actually there. */
      if (*(volatile blt_int32u *)word_addr != word_data)
      {
        result = BLT_FALSE;
        break;
      }
    }
  }

  /* lock the flash peripheral to disable the flash control register access. */
  HAL_FLASH_Lock();

  /* Give the result back to the caller. */
  return result;
} /*** end of FlashWriteBlock ***/


/*********************************** end of flash.c ************************************/
